#+TITLE: Lorelei, an Alternative Nix extension of Direnv
#+SETUPFILE: doc/links.org

[[https://github.com/shajra/direnv-nix-lorelei/actions][https://github.com/shajra/direnv-nix-lorelei/workflows/CI/badge.svg]]

** Setup action

   The following helps (using Noweb) set up Nix environment variables for
   source block evaluation.

   #+NAME: pwd
   #+BEGIN_SRC shell :results silent
     echo cd "$(pwd)"
   #+END_SRC

   #+RESULTS: pwd
   : cd /home/tnks/src/shajra/direnv-nix-lorelei

   #+NAME: nix-init
   #+BEGIN_SRC shell :eval no
     export NIX_PROFILE=$(pwd)/nix-profile
     export NIX_PAGER=cat
     export PATH="$NIX_PROFILE/bin:$PATH"
     export PS1='$ '
   #+END_SRC

   Next we perform some side-effects to set up the evaluation of the whole
   document.

   #+NAME: cleanup
   #+BEGIN_SRC shell :results output silent :noweb yes
     <<nix-init>>
     rm --force result* || true
     rm --force "$NIX_PROFILE"* || true
   #+END_SRC

   This begins a session with environment variables initialized.

   #+NAME: session-init
   #+BEGIN_SRC bash :session env :results silent :noweb yes
     <<pwd()>>
     <<nix-init>>
   #+END_SRC

** Installing Lorelei

   This project provides a Nix expression in the project's root =default.nix=
   file.  From the root directory of a checkout of the project, you can install
   Lorelei as follows:

   #+NAME: lorelei-install
   #+BEGIN_SRC shell :session env :results output :exports both
     nix-env --install --file . --attr direnv-nix-lorelei 2>&1
   #+END_SRC

   #+RESULTS: lorelei-install
   : installing 'direnv-nix-lorelei'

   This installation doesn't install a binary, but instead a shell library that
   you use as configuration for Direnv.  Given a typical installation of Nix,
   this installation should be into the active Nix profile at =~/.nix-profile=.
   We can tie this library to Direnv with a symlink:

   #+BEGIN_SRC shell :eval no
     mkdir --parents ~/.config/direnv/lib
     ln --force --symbolic --no-target-directory \
         ~/.nix-profile/share/direnv-nix-lorelei/nix-lorelei.sh \
         ~/.config/direnv/lib
   #+END_SRC

** Direnv installation

   If you don't already have Direnv installed, you have the option of installing
   Direnv from this project (otherwise, you can skip this section):

   #+NAME: direnv-install
   #+BEGIN_SRC shell :session env :results output :exports both
     nix-env --install --file . --attr direnv 2>&1
   #+END_SRC

   #+RESULTS: direnv-install
   : installing 'direnv-2.22.0'

   If you have =~/.nix-profile/bin= in your environment's =PATH=, you should be
   able to call the =direnv= executable.  Here's a simple way of testing its
   availability.

   #+NAME: direnv-version
   #+BEGIN_SRC shell :session env :results output :exports both
     direnv version
   #+END_SRC

   #+RESULTS: direnv-version
   : 2.22.0

** Per-project configuration

   If you have a project that can be used to enter a Nix shell with a call like

   #+BEGIN_SRC shell :eval no
     nix-shell "$NIX_FILE"
   #+END_SRC

   for some file =$NIX_FILE=, then at the root of the project you can create a
   =.envrc= to get started with Direnv:

   #+BEGIN_SRC shell :eval no
     echo "use_nix_gcrooted -a \"$NIX_FILE\"" > .envrc
   #+END_SRC

   As with =nix-shell= specifying a Nix file as a positional argument is
   optional if you're file is called =shell.nix=.  Furthermore, if you don't use
   =shell.nix=, but use =default.nix= it is also optional.

   Finally, we can activate the configuration (Direnv has some security measures
   to prevent abuse from running arbitrary scripts):

   #+BEGIN_SRC shell :eval no
     direnv allow
   #+END_SRC

   At this point, if you have your terminal and editor configured to use Direnv,
   you should experience per-project environments serviced by Direnv.

   To learn more more about Lorelei's options, we can source the script and run
   the function outside Direnv:

   #+BEGIN_SRC shell :eval no
     . ~/.nix-profile/share/direnv-nix-lorelei/nix-lorelei.sh
     use_nix_gcrooted --help
   #+END_SRC

   #+BEGIN_SRC shell :session env :results output :exports results
     . "$NIX_PROFILE/share/direnv-nix-lorelei/nix-lorelei.sh"
     use_nix_gcrooted --help
   #+END_SRC

   #+RESULTS:
   #+begin_example

   USAGE: use_nix_gcrooted [OPTION]... [FILE]

   DESCRIPTION:

       A replacement for Direnv's use_nix.  This function, will make
       sure calculated Nix expressions are GC rooted with Nix.  By
       default the calculated environment is also cached, which is
       useful for Nix expressions that have costly evaluations.  To
       invalidate the cache, files can be watched either by their
       content hash or their modification time.  You can also delete
       .direnv/delete_to_rebuild to invalidate the cache.

   OPTIONS:

       -h --help                print this help message
       -a --auto-watch-content  watch autodetected files for contect
				changes
       -A --auto-watch-mtime    watch autodetected files for
				modification times
       -d --auto-watch-deep     deeper searching for -a and -A options
       -w --watch-content PATH  watch a file's content for changes
       -W --watch-mtime PATH    watch a file's modification time
       -C --ignore-cache        recompute new environment every time
       -k --keep-last NUM       protect last N caches from GC
				(default 5)
   #+end_example

   With the =--auto-watch-content= and =--auto-watch-mtime= switches, you don't
   have to worry about which files to watch for changes.  You can either watch
   these files when their modifications time change, or when their content
   actually changes (touching a file changes its modification time, but not its
   content).

   The =--auto-watch-content= and =--auto-watch-mtime= switches catch a good
   amount of Nix files, but won't catch everything you might have the idea
   to watch.  If you want to specify files to watch explicitly, you can use the
   =--watch-content= and =--watch-mtime= switches.

   You can use the =--auto-watch-deep= switch to have the auto-watching features
   look a little deeper for files to watch.  However, the evaluation time you'll
   face for an not-yet-cached environment will be notably longer for this deeper
   search (possibly twice as long).  Note auto-watching without the
   =--auto-watch-deep= switch shouldn't add much evaluation overhead, so you
   should be able to use the normal shallower auto-detection without worrying
   about a slowdown.

   If for some (unlikely) reason, you want the benefits of protection from Nix
   garbage collection, but not cache the evaluation of environments, you can use
   =--ignore-cache=.  Note, that you still need to specify files to watch for
   changes.  With =--ignore-cache=, you'll recalculate the Nix expression for
   your project every time these watched files trigger Direnv to recalculate an
   environment.

   Lorelei keeps the last five environments from being garbage collected.  You
   can change this with =--keep-last=.

   And finally, if you ever feel like you want to dump your cached environment
   and recalculate everything, just delete =.direnv/delete_to_rebuild=, which
   will be next to your project's =.envrc= file.

   Lorelei's metadata for your project is in two places:
   - your project's =.direnv= directory
   - your user's GC root directory: =/nix/var/nix/gcroots/per-user/$USER=

   You can delete this data to start fresh.

   The symlinks in the GC root directory have human readable names to assist
   manual curation if you need it.

